Tekla.Structures.Drawing.IntList
The IntList class defines a type safe list of integers.
The following example adds some integers to the list and calculates the sum of them:
using Tekla.Structures.Drawing;
public class Example
{
public void Example1()
{
int Sum = 0;
IntList MyIntList = new IntList();
MyIntList.Add(1);
MyIntList.Add(2);
MyIntList.Add(5);
foreach(int MyInt in MyIntList)
{
Sum += MyInt;
}
}
}

Tekla.Structures.Drawing.IntList.Item(System.Int32)
Gets or sets the integer at the specified index.
index: The zero-based index of the element to get or set.

Tekla.Structures.Drawing.IntList.Add(System.Int32)
Adds a new integer to the end of the string list.
value: The integer to be added to the list.
Returns: The index where the integer was added.

Tekla.Structures.Drawing.IntList.Contains(System.Int32)
Checks if the given integer is in the list.
value: The integer to be checked.
Returns: True if the integer is in the list, otherwise false.

Tekla.Structures.Drawing.IntList.IndexOf(System.Int32)
Gets the index of the specified integer.
value: The integer to locate in the list.
Returns: The index of the integer if found in the list, otherwise -1.

Tekla.Structures.Drawing.IntList.IndexOf(System.Int32,System.Int32)
Gets the index of the specified integer between the index to start
the search from and the end of the list.
value: The integer to locate in the list.
startIndex: The index to start the search from.
Returns: The index of the integer if found in the list, otherwise -1.

Tekla.Structures.Drawing.IntList.IndexOf(System.Int32,System.Int32,System.Int32)
Gets the index of the specified integer between the index to start the search from and startIndex + count.
value: The integer to locate in the list.
startIndex: The index to start the search from.
count: The number of items searched.
Returns: The index of the integer if found in the list, otherwise -1.

Tekla.Structures.Drawing.IntList.Insert(System.Int32,System.Int32)
Inserts the integer to the specified index.
index: The index where the integer is inserted.
value: The integer to be inserted.

Tekla.Structures.Drawing.IntList.GetRange(System.Int32,System.Int32)
Gets a sub-list of the integer list.
index: The start index of the new list.
count: The number of items in the new list.
Returns: The new integer list.

Tekla.Structures.Drawing.IntList.LastIndexOf(System.Int32)
Searches for the last occurence of the integer in the list.
value: The integer to locate.
Returns: The last index of the integer if found, otherwise -1.

Tekla.Structures.Drawing.IntList.LastIndexOf(System.Int32,System.Int32)
Searches for the last occurence of the integer in the list.
value: The integer to locate.
startIndex: The index to start the search from.
Returns: The last index of the integer if found, otherwise -1.

Tekla.Structures.Drawing.IntList.LastIndexOf(System.Int32,System.Int32,System.Int32)
Searches for the last occurence of the integer in the list.
value: The integer to locate.
startIndex: The index to start the search from.
count: The number of items searched.
Returns: The last index of the integer if found, otherwise -1.

Tekla.Structures.Drawing.IntList.Remove(System.Int32)
Removes the first occurence of the integer from the list.
value: The integer to be removed.

Tekla.Structures.Drawing.IntList.RemoveRange(System.Int32,System.Int32)
Removes a range of items starting from the given index.
index: The start index.
count: The number of items to be removed.

Tekla.Structures.Drawing.IntList.ToArray
Copies the integers to an integer array.
Returns: The array of integers.

Tekla.Structures.Drawing.IntList.IsEqual(System.Object)
Compares the current object with an object of the same type.
ObjectToCompare: The object to be used for comparing.
Returns: True if all the fields (except for the database GUID) of the objects match.